Repository: tryswift/try-swift-tokyo
Catalog: MyLibrary/Sources/ScheduleFeature/Localizable.xcstrings
Source language: en
Languages: ja

source: I have completed more than a decade long experience in the field of futuristic developments and managed to gain a portfolio of local and international clientele while working with prominent corporate entities in Sri Lanka. Currently serving as the Chief Technology Officer for Fixel Digital which is a development house specifically for Mobile application developments . it's a pleasure that I am well known for my Punctuality, Attention to detail, and innovative mindset among the clients and the industry that I am being with I have started iOS Development in its early development stage in 2011. I have been in the apple ecosystem for more than a decade now, also Delivered more than 55+ Apps, including iOS, macOS, tvOS, and watchOS. At the same time, I am serving my knowledge to Students in the IT industry and providing consultation services to my clients from overseas.
ja: 未来志向の開発に10年以上携わり、国内外の企業と協力しながら幅広いクライアントのポートフォリオを築いてきました。 現在はFixel Digitalの最高技術責任者（CTO）として、モバイルアプリ開発を専門とする開発チームを率いています。業界内では「時間厳守」「細部へのこだわり」「革新的な発想」で知られています。 iOS開発には2011年の初期の段階から携わっており、Appleのエコシステムで10年以上の経験を積んできました。これまでにiOS、macOS、tvOS、watchOS向けに55本以上のアプリを開発・リリースしてきました。また、IT業界の学生に知識を共有したり、海外クライアントへのコンサルティング業務も行っています。

source: I love beautiful movies, novels, photography and mobile apps!
ja: 美しい映画、小説、写真、モバイルアプリが好きです

source: I usually develop iOS apps at LY Corporation and actively output through blogging and speaking engagements. Last year, I spoke 13 times.
ja: LY CorporationでiOSアプリを開発しています。ブログや登壇などのアウトプットにも積極的に取り組んでおり、昨年は13回の登壇を行いました。

source: I will be presenting a fast, real time, infinite canvas user interface implementation using Metal, and will be exploring the use of Multi-channel Signed Distance Fields (MSDFs), for rendering text that looks beautiful and sharp at any zoom level or orientation.
ja: Metalを活用した高速かつリアルタイムの無限キャンバス型ユーザーインターフェースの実装例を発表します。 また、どのズームレベルや向きでも美しくシャープに表示されるテキストをレンダリングするために、Multi-channel Signed Distance Fields（MSDF）の利用法について探求します。

source: I write a simple iOS game app which only has the "left" and "right" action. But the exciting is that the user input can be in many way. You can choose slider, button, accelerometer, keyboard, and the new feature in iOS 18: eye tracking. So you also can use it to test any IO functionality you find.
ja: 私は、"左"と"右"のアクションだけを持つシンプルなiOSゲームアプリを作りました。しかし、興味深いのはユーザー入力の方法が多様である点です。 スライダー、ボタン、加速度センサー、キーボード、そしてiOS 18で新たに登場したアイ・トラッキングなど、様々な入力手段を選択できます。 さらに、この仕組みを活用して、あらゆる入出力機能のテストにも利用することが可能です。

source: I'm a New Zealander who has been living in Japan for the past 10 years. I primarily work with low level, real time graphics and audio. This year, I founded a company called kapsy.io, and am currently working on a real time generative music sequencer with the code named _Variations_.
ja: ニュージーランド出身で、日本に住んで10年になります。主に低レベルなリアルタイムのグラフィックスやオーディオを扱っています。 今年、新しくkapsy.ioという会社を設立し、現在はリアルタイムで生成される音楽シーケンサーVariations（コードネーム）の開発を進めています。

source: I’m an Individual developer. I’ve released a variety of apps for Apple platforms. iOS & iPadOS: 7 apps visionOS: 5 apps watchOS: 5 apps tvOS: 1 app macOS: 3 apps Portfolio link [flipbyblink.github.io/Portfolio](https://flipbyblink.github.io/Portfolio/)
ja: 個人開発者として、Appleプラットフォーム向けにさまざまなアプリをリリースしています。 iOS & iPadOS アプリ：7 visionOS アプリ：5 watchOS アプリ：5 tvOS アプリ：1 macOS アプリ：3 ポートフォリオ： [flipbyblink.github.io/Portfolio](https://flipbyblink.github.io/Portfolio/)

source: I'm an iOS and Android app developer working on a banking and card payment service at SmartBank.
ja: iOSおよびAndroidアプリ開発者として、SmartBankで銀行およびカード決済サービスの開発に携わっています。

source: I’m Chris, also known as Halordain! I grew up in Dallas, Texas, and attended college at Stanford. I majored in electrical engineering with a specialization in image processing. I started studying Japanese to scout my opponents from Japan at the Pokémon World Championships, where my quarterfinals and semifinals opponents hailed from Yokosuka and Fujisawa, respectively. My journey led me to Doshisha University to master Japanese under the Critical Language Scholarship. I abandoned my PhD at MIT CSAIL to pursue software development in Japan. Originally hired at Creatures Japan to process images for Pokémon cards, I ended up learning Objective-C to develop my first iPad app, [Pokédex for iOS (Creatures, 2012)](https://www.pokemon.co.jp/ex/pokedex/ja/). After Creatures, I contracted with Bandai-Namco Studios to build the graphics engine behind [Super Smash Bros. for 3DS](https://www.smashbros.com/wiiu-3ds/us/3ds/). I parlayed my rendering knowledge in computer graphics, my image processing background, and my interest in iOS development into developing iOS Photoshop for Adobe, and eventually joined Apple to document their new graphics technologies such as Metal, ARKit, CreateML, and RealityKit. I returned to Japan to help spearhead Nintendo of Japan’s smartphone game design, starting with Fire Emblem Heroes and [Pikmin Bloom](https://pikminbloom.com/ja/). These development experiences led me to craft my own path creating educational apps and experiences for teaching Japanese kids about AI and Swift.
ja: こんにちは！Chris（Halordain）です！ テキサス州ダラスで育ち、スタンフォード大学で電気工学（画像処理専攻）を学びました。ポケモン世界大会で日本の対戦相手をリサーチするために日本語の勉強を始め、準々決勝・準決勝では横須賀と藤沢出身のプレイヤーと対戦しました。 その後、Critical Language Scholarshipを活用し、日本語を習得するために同志社大学へ留学。MIT CSAILの博士課程を辞め、日本でソフトウェア開発の道を選びました。 最初の仕事はクリーチャーズでポケモンカードの画像処理を担当することでした。そこでは、Objective-Cを学び、初のiPadアプリ [ポケモン図鑑 for iOS (クリーチャーズ, 2012)](https://www.pokemon.co.jp/ex/pokedex/ja/) を開発しました。 その後、バンダイナムコスタジオで [大乱闘スマッシュブラザーズ for 3DS](https://www.smashbros.com/wiiu-3ds/us/3ds/) のグラフィックスエンジンの開発に携わり、コンピュータグラフィックスと画像処理の知識を活かしてAdobeでiOS向けPhotoshopの開発を担当しました。さらに、AppleではMetal・ARKit・CreateML・RealityKitなどの新しいグラフィック技術のドキュメント作成を担当しました。 日本に戻った後は任天堂のスマートフォンゲーム開発に携わり、「ファイアーエムブレム ヒーローズ」や [ピクミン ブルーム](https://pikminbloom.com/ja/) の開発を支援。現在は、AIやSwiftを子どもたちに教える教育アプリを開発しています。

source: ikesyo is a Swift (corelibs-foundation) contributor. He was also the author or maintainer of projects such as Himotoki, Quick, Nimble, Carthage, and ReactiveSwift. He is currently developing various manga apps at Hatena Co., Ltd.
ja: ikesyoはSwift (corelibs-foundation)のコントリビューターである。Himotoki、Quick、Nimble、Carthage、ReactiveSwiftなどのプロジェクトの作者またはメンテナーでもある。現在は株式会社はてなで様々な漫画アプリを開発中。

source: Immersive Video is a 180-degree video that appears three-dimensional. My team and I, along with several collaborators, captured an Immersive Video of FC Machida Zelvia—a professional soccer team in Japan's J1 League—and hosted a hands-on session exclusively for special members. This project was made possible through the club's support and cooperation. The event was a great success, and we encountered many challenges and learned a great deal through trial and error in the processes of filming, video editing, developing the Swift-based Viewer, and running the session. I'm especially eager to share the in-depth insights we gained from building the Viewer in Swift and the overall experience. It's rare to see professional sports filming projects and Immersive Video technology being showcased at developer conferences, and there are many fascinating insights to be shared from both the video capturing process and the Viewer application development.
ja: Immersive Videoは立体的に見える180度動画です。 私と複数人のチームで、サッカーJ1リーグ所属のFC町田ゼルビアのImmersive Videoを撮影し特別会員向けに体験会を実施しました。クラブ協力のもと実現できました。体験会は大成功。撮影、動画編集、Viewer実装、体験会、どれも試行錯誤があり多くの知見を得られました。特にSwiftで実装したViewerの作り込みと体験についての深掘りした知見を共有したいです。 プロスポーツの撮影自体が開発者向けのカンファレンスで共有される事例が少ないですし、Immersive Video撮影、Viewerアプリも面白い知見が多数です。

source: In a world increasingly dominated by Artificial Intelligence (AI), this presentation challenges the audience to consider an alternate future: one where AI is not the centrepiece of technological advancement. We delve into the implications of a future less reliant on AI, discussing the potential benefits and drawbacks. The talk focuses on three key areas: human creativity and innovation, the preservation of traditional skills and knowledge, and the ethical considerations of a non-AI-centric world. Firstly, we explore how a reduced emphasis on AI could foster greater human creativity and innovation. Without AI's influence, there might be a resurgence in traditional problem-solving approaches and a renewed emphasis on human ingenuity. Secondly, the talk addresses the preservation of traditional skills and knowledge. In a world less dependent on AI, these skills might not only survive but thrive, leading to a more diverse technological landscape. Finally, we discuss the ethical implications of a world without pervasive AI. This includes considerations of privacy, employment, and societal structure, and how these might differ from a future where AI plays a central role.
ja: AIが支配する世界では、技術の未来をAI中心ではないものとして想像することは、一種の挑戦です。このプレゼンテーションでは、AIに頼らない未来がもたらすかもしれないメリットとデメリットを探ります。 話は大きく三つの部分に分かれています。一つ目は、AIに頼らないことで人間の創造性やイノベーションがどう促進されるか。AIがなければ、昔ながらの問題解決法が復活し、人間のひらめきが再び重要視されるかもしれません。 二つ目は、伝統的な技術や知識の保存について。AIに依存しない世界では、これらの技術がただ生き残るだけでなく、繁栄することで、技術の多様性が広がる可能性があります。 最後に、あらゆる場所にAIがあるわけではない世界の倫理的な問題について考えます。プライバシー、雇用、社会構造に関する考え方が、AIが中心の未来とどう違うのかを見ていきます。

source: In short, this is a story about hacking Genmoji. Genmoji can now be displayed in notifications from iOS18. In this talk, we will reverse engineer Genmoji and display custom emojis in notifications. I'm a third-party app developer for Mastodon. This talk is perfect for me.
ja: 簡単に言えば、これはGenmojiをハックする物語です。 iOS 18から、通知にGenmojiが表示されるようになりました。 このトークでは、Genmojiのリバースエンジニアリングを行い、カスタム絵文字を通知に表示する方法をご紹介します。 私はMastodon向けのサードパーティアプリ開発者ですが、この内容は私にとってまさに理想的なテーマです。

source: In software design, it is crucial to focus on seamlessly integrating the platform's system with the creator's unique concept. Aiming for a harmonious and well-designed UI is a shortcut to creating software that is user-friendly and easy to use. This talk will focus on UI design for applications on macOS and iOS, discussing how creators can assert their uniqueness, adapt to the platform, and balance respect for cultural considerations.
ja: ソフトウェアのデザインでは、プラットフォームのシステムとクリエイター独自のコンセプトとが矛盾なく成り立つことに強く意識を向けなければなりません。調和の取れた良いUIを目指すことは、ユーザーにとって親しみやすく、使いやすいソフトウェアへの近道です。この講演では、macOSやiOSにおけるアプリケーションのUIデザインに焦点を当て、クリエイターがアプリケーションを設計する際の自らの独自性の主張方法、プラットフォームへの適合方法、および文化尊重との塩梅を考えます。

source: In Swift, you can define identifiers not only in English but also in various natural languages. Recently, I released a Shogi app for all Apple platforms, including Apple Vision Pro. In this app, I wrote almost all identifiers in Japanese—except for reserved words and imported frameworks. In this talk, I'll share insights from my experience with Swift programming using Japanese identifiers.
ja: Swiftでは英語だけでなく様々な自然言語で識別子を定義することができます。 私は最近、日本の伝統的ボードゲーム「将棋」のアプリをApple Vision Pro含む全てのAppleプラットフォーム向けにリリースしました。 このアプリでは「予約語」や「インポートしたフレームワーク」を除いたほぼ全ての識別子を日本語で書きました。 今回は「日本語識別子Swiftプログラミング」の知見を紹介します。

source: In this session, I'll share insights gained from a project to rewrite the game "Simutrans" in Swift, focusing on the practicality of C++ interoperability and the anticipated developments in the future. You'll learn how to leverage these insights to potentially challenge yourself with porting C++ projects to Swift.
ja: 本セッションでは、SimutransというゲームをSwiftで書き換えるプロジェクトを通じて得た知見をもとに、C++ interoperabilityの実用性と今後期待される発展についてお話しします。皆さんも、このトークで学べることを活かして、C++プロジェクトのSwift書き換えにチャレンジしてみませんか？

source: In this talk I'll show you how you can design your app data pipeline in a modular way, and integrate my open source tools to enable easy bug reproduction and faster development workflows.
ja: 本セッションでは、アプリのデータパイプラインをモジュラーな方法で設計する手法を紹介します。さらに、私のオープンソースツールを統合することで、簡単なバグ再現と迅速な開発ワークフローを実現する方法を解説します。

source: In this talk, we’ll explore Duolingo's efforts to build a virtual language tutor, using the latest AI technology. In 2023, Duolingo launched a new feature built on GPT-4 called Roleplay, to simulate the experience of realistic conversation practice in a foreign language. As an engineer behind the product, I'll discuss iOS-specific challenges, as well as common issues working with generative AI issues, such as latency optimization. The talk concludes with an interactive demo of the Roleplay feature, providing an inside look at how AI is transforming language learning.
ja: この講演では、最新のAI技術を使用して仮想言語チューターを構築するためのDuolingoの取り組みを探ります。2023年にDuolingoは、GPT-4を基盤とした新機能「Roleplay」を発表しました。これは、外国語でのリアルな会話練習体験をシミュレートすることを目的としています。製品開発に携わるエンジニアとして、iOS固有の課題や、生成AIを扱う際の一般的な問題点、例えばレイテンシの最適化などについて話します。講演は、Roleplay機能のインタラクティブなデモで締めくくられ、AIが言語学習をどのように変革しているかの内側を垣間見ることができます。

source: In this workshop we will look at the Swift compilation process and what those parts are, learn a bit about LLVM, how to find a bug to work on using bugs.swift.org and then making a build with our changes and running tests.A merged pull request is not the goal of this workshop, but after attending this workshop you should have enough knowledge to get started and know where to look to learn more. If you are proficient in C++ or even have some experience with LLVM, then you can start working with the Swift compiler right away. If you do not have former C++ knowledge fear not, the Swift standard library or SwiftSyntax are written mostly in Swift and the python / swift hybrid '.gyb' files. In addition, we’re welcome to contribute to any other Swift family projects, like Foundation, Swift Package Manager, or any other first-party libraries.
ja: このワークショップでは、Swiftのコンパイル過程とその部分について学びます。LLVMの基礎知識を少し学び、bugs.swift.orgを使って修正すべきバグを見つけ出し、変更を加えたビルドを作ってテストを行う方法についても扱います。このワークショップの目的はプルリクエストをマージすることではありませんが、参加後は始めるために必要な知識を身につけ、さらに学ぶべき方向性を理解できるようになるでしょう。 もしC++が得意であるか、LLVMに関する経験が少しでもあれば、Swiftコンパイラの作業をすぐに開始できます。 C++の経験がなくても大丈夫です。Swift標準ライブラリやSwiftSyntaxは主にSwiftで書かれており、PythonとSwiftのハイブリッドファイルである「.gyb」ファイルも存在します。また、Foundation、Swift Package Manager、その他のファーストパーティライブラリなど、Swiftファミリーのプロジェクトへの貢献も歓迎しています。

source: In this workshop we'll walk through how Swift's new Observable system is revolutionizing the way we write SwiftUI code, then move on to explore how it's used inside the SwiftData framework make app storage easier than ever. Please come with the latest Xcode installed on your laptop, because this is a hands-on workshop and you'll be expected to write a lot of code.
ja: このワークショップでは、Swiftの新しいObservableシステムがSwiftUIのコードの書き方にどのような革命を起こしているのかを説明し、SwiftDataフレームワークの中でどのように使われているのかを探ることで、アプリのストレージをこれまで以上に簡単にします。これは実践的なワークショップであり、多くのコードを書くことが予想されるため、最新のXcodeをラップトップにインストールした状態でお越しください。

source: In this workshop you'll learn everything you need to build a simple Vapor application. You'll learn how to create routes, saves models to a database and build REST APIs. This workshop is fully updated for async/await!
ja: このワークショップでは、シンプルなVaporアプリケーションを構築するために必要なすべてを学びます。ルートを作成し、モデルをデータベースに保存し、REST APIを構築する方法を学びます。このワークショップはasync/awaitに完全に対応しています！

source: In this workshop, we'll learn how to control Bluetooth Low Energy devices such as LEGO using Swift and Core Bluetooth. First, we'll deepen our understanding of controlling Bluetooth Low Energy (BLE) devices with Swift. After learning an overview of BLE and how to use Core Bluetooth, we will conduct a demonstration using the STAR WARS R2-D2 droid kit provided by littleBits. Next, we'll learn about the LEGO Wireless Protocol, which is the protocol for controlling LEGO via BLE. Finally, we'll utilize LEGO kits to create something that moves together. Note : Please note that the number of kits is limited, so if there are many participants, we'll form teams to conduct the workshop.
ja: このワークショップでは、SwiftとCore Bluetoothを使用してレゴなどのBluetooth Low Energyデバイスを動かす方法を学びます。 最初に、SwiftでBluetooth Low Energy（BLE）機器を制御する方法について理解を深めていきます。BLEの概要とCore Bluetoothの使い方を学んだあとに、具体的なデモとして、littleBitsが提供するSTAR WARS R2-D2ドロイド・キットによるデモンストレーションをします。 次に、BLEでレゴを制御するためのプロトコルであるLEGO Wireless Protocolについて学習します。最後に、レゴのキットを活用して、一緒に動くものを作ります。 ※キットの数には限りがあるため、参加者が多い場合はチームを組んでワークショップを行います。

source: Introduction to security research and bounty hunting on Apple's platforms
ja: Appleプラットフォームにおけるセキュリティリサーチとバウンティハンティング入門

source: iOS & visionOS app developer in Japan. Crafting 𝙫𝙚𝙖𝙧 and DAWN for mastodon. Loving #foxes. [vear - Anime Avatar Camera](https://apps.apple.com/jp/app/vear-anime-avatar-camera/id1490697369?l=en-US) [DAWN for Mastodon](https://apps.apple.com/jp/app/dawn-for-mastodon/id1668645019?l=en-US)
ja: 日本でiOSとvisionOSのアプリを開発しています。 Mastodon向けの𝙫𝙚𝙖𝙧やDAWNなどのアプリ開発を手がけています。 #foxes（キツネ）が大好きです。 [vear - Anime Avatar Camera](https://apps.apple.com/jp/app/vear-anime-avatar-camera/id1490697369?l=en-US) [DAWN - Mastodon クライアント](https://apps.apple.com/jp/app/dawn-for-mastodon/id1668645019?l=en-US)

source: iOS app developer, creating personal projects like #Type, Quiz Match, and more. Living in Tokorozawa, Saitama, in a renovated pre-owned apartment with my wife and two cats. Photography enthusiast, traveling across Japan as a photographer for Japan-\\(region).swift.
ja: iOSアプリを作る仕事をしています。個人アプリとして#Type、Quiz Matchなどを開発しています。 埼玉県所沢市で中古マンションを購入。リノベーションして2匹の猫、そして妻と住んでいます。 趣味はカメラで、Japan-\\(region).swiftではカメラマンとして各地に飛んだりしています。

source: Java's annotation processing leverages developer productivity by compile-time code generation. Swift can now replicate that innovation with Swift Macros and Swift Syntax. Learn how to express annotation-like features in Swift, automate code, and boost productivity. Let's unlock Swift's potential!
ja: Javaのアノテーションプロセッシングは、コンパイル時のコード生成によって開発者の生産性を大きく向上させています。 Swiftも、Swift MacrosとSwift Syntaxを活用することで、この革新的な手法を再現できるようになりました。 Swiftにおいて、アノテーションに似た機能をどのように表現し、コード自動生成で生産性を向上させるかを学び、Swiftの潜在能力を解き放ちましょう！

source: Join us as we build a ChatGPT client, from scratch, using Swift OpenAPI Generator. We'll take advantage of Swift OpenAPI's pluggable HTTP transports to reuse the same generated client to make upstream calls from a Linux server, providing end-to-end streaming, backed by async sequences, without buffering upstream responses. In this session you'll learn how to: Generate a type-safe ChatGPT macOS client and use URLSession OpenAPI transport. Stream LLM responses using Server Sent Events (SSE). Bootstrap a Linux proxy server using the Vapor OpenAPI transport. Use the same generated ChatGPT client within the proxy by switching to the AsyncHTTPClient transport. Efficiently transform responses from SSE to JSON Lines, maintaining end-to-end streaming.
ja: Swift OpenAPI Generatorを使って、ゼロからChatGPTクライアントを構築するライブコーディングに参加してください。 Swift OpenAPIのプラガブルなHTTPトランスポート機能を活用し、生成された同一クライアントを再利用してLinuxサーバーから上流呼び出しを行います。これにより、非同期シーケンスに支えられたエンドツーエンドのストリーミングが、上流レスポンスをバッファリングすることなく実現できます。 このセッションでは、以下の内容を学びます: ・タイプセーフなChatGPT macOSクライアントを生成し、URLSession OpenAPIトランスポートを使用する方法 ・サーバー送信イベント（SSE）を利用して、LLMのレスポンスをストリーミングする方法 ・Vapor OpenAPIトランスポートを用いて、Linuxプロキシサーバーをブートストラップする方法 ・AsyncHTTPClientトランスポートに切り替えることで、プロキシ内で同じ生成済みChatGPTクライアントを利用する方法 ・SSEからJSON Linesへのレスポンス変換を効率的に行い、エンドツーエンドのストリーミングを維持するテクニック

source: Join us for a live recording of the popular podcast "Swift over Coffee," where the latest Swift news and practical techniques are discussed. Hosted by Paul Hudson and Mikaela Caron, the show dives into new Swift features, community trends, and coding tips that prove invaluable in everyday development. In addition to the standard recording session, the event features a Q&A with the audience—offering a unique chance to hear exclusive behind-the-scenes stories and up-to-the-minute development insights. This is an ideal opportunity for Swift developers to catch up on cutting-edge trends and strengthen their ties within the community.
ja: 最新の Swift ニュースや実用的なテクニックについて議論する人気のポッドキャスト「Swift over Coffee」のライブ録画に参加してください。ポール ハドソンとミカエラ キャロンが司会を務めるこの番組では、Swift の新しい機能、コミュニティのトレンド、日常の開発で非常に役立つコーディングのヒントについて詳しく説明します。このイベントでは、通常のレコーディング セッションに加えて、聴衆との Q&A も行われ、特別な舞台裏の話や開発に関する最新の洞察を聞くユニークな機会が提供されます。これは、Swift 開発者にとって最先端のトレンドを把握し、コミュニティ内の絆を強化する理想的な機会です。

source: Katsumi has been developing software for the Apple platform for over 10 years and currently works for a company that develops low-code platforms. He works on automating all kinds of tasks. In his spare time, he builds and maintains various open source projects that improve developer productivity.
ja: Apple Platformのソフトウェアを専門に開発しているソフトウェアエンジニアです。現在はローコードでアプリ開発するサービスを提供する会社で働いていて、あらゆる作業を自動化する仕事をしています。空いた時間には、デベロッパーの生産性を向上するさまざまなオープンソースプロジェクトをメンテナンスしています。

source: Kazuhiro Kamakura works at LY corporation. He loves not only programming but also making things in general. In his spare time, he remodels houses.
ja: LINEヤフー株式会社勤務。プログラミングだけでなく、ものづくり全般が好き。趣味は家のリフォーム。

source: Kazuya worked as a web engineer leader at Kayac, and then fell in love with 3DCG and VR, and moved to the VR team at COLOPL, where he worked as a lead engineer for the development of the VR game "Nyoro The Snake & Seven Islands" and experienced developing many VR games. After joining MESON, he worked as an XR engineer before becoming CTO.
ja: 面白法人カヤックでWebエンジニアのリーダーを務めたのち3DCGおよびVRの魅力にハマり、その後コロプラの仮想現実チームに転籍。VRゲーム「Nyoro The Snake & Seven Islands」開発のリードエンジニアを務め、多数のVRゲーム開発を経験。MESONに入社後、XRエンジニアとして活動したのち、CTOに就任。

source: Key
ja: もくもく会

source: Konrad works in the Swift language team at Apple, where he focuses on concurrency and distributed modules of the language, and server-side focused libraries. He was part of the design and implementation of Swift’s structured concurrency and actor model, as well as the distributed actors language feature and cluster library. Currently he's focused on Swift/Java interoperability efforts. Previously, he worked on Akka at Lightbend/Typesafe, where he maintained core pieces of the ecosystem, including the clustering, event sourcing, streaming and HTTP libraries. He also is a Java Champion and made significant contributions to the reactive-streams specification and TCK which later became the foundation of the JDK’s java.util.concurrent.Flow types.
ja: KonradはAppleのSwift言語チームで、並行処理や分散モジュール、サーバーサイド向けライブラリの開発に取り組んでいます。Swiftの構造化並行処理やアクターモデル、分散アクターの言語機能やクラスタライブラリの設計・実装に携わりました。現在はSwiftとJavaの相互運用性の向上に注力しています。以前はLightbend/TypesafeでAkkaの開発に従事し、クラスタリング、イベントソーシング、ストリーミング、HTTPライブラリなどの中核部分を担当していました。また、Java Championとして、後にJDKの java.util.concurrent.Flow 型の基盤となったリアクティブストリーム仕様とTCKにも大きく貢献しました。

source: Krzysztof is shaping the future of Apple platforms with tools adopted by 80K+ teams, from Apple to Disney. 🏆 2x Engineering Emmy winner, co-founder of Pixle, and creator of Foldify & Sourcery for Xcode.
ja: KrzysztofはAppleプラットフォームの未来を形作るツールを開発しており、これまでにAppleやDisneyを含む8万以上のチームに採用されています。🏆 エンジニアリング・エミー賞を2度受賞しており、Pixleの共同創設者でもあります。また、Xcode用のFoldifyやSourceryのクリエイターでもあります。

source: Laptops with the latest stable Xcode and building the Swift compiler is preferred. Instruction will be provided beforehand.
ja: 最新の安定版Xcodeを搭載したラップトップを用意してください。事前にSwiftコンパイラをビルドしてくることが推奨されます。そのための指示は事前に提供されます。

source: Latest Xcode, Unity if needed and Apple Vision Pro (if you have, not required)
ja: 最新のXcodeを入れてきてください。必要な人はUnityも。Apple Vision Proは必須ではありません。

source: Learning Swift's Type Inference
ja: Swiftの型推論を学ぼう

source: Let's learn about Apple's newest framework TabletopKit for visionOS! You will learn what is TabletopKit and how you can get started using it to build games for visionOS. We'll review the basics of the framework and what it gives you, as opposed to building a game without it. We'll then explore how we would build Monopoly using TabletopKit. No visionOS experience is necessary for getting started! By the end of the talk you'll be able to begin building your own tabletop games.
ja: Appleの最新フレームワーク、visionOS向けTabletopKitについて学びましょう！ このセッションでは、TabletopKitとは何か、そしてそれを使ってvisionOS向けのゲームをどのように構築できるかを理解します。 フレームワークの基本機能と、それを活用することで得られるメリット（従来の方法でゲームを作る場合との違い）についても解説します。 さらに、TabletopKitを使用してモノポリーをどのように構築するかについて探求します。 visionOSの経験がなくてもすぐに始められる内容です！ トークの最後には、自分自身のテーブルトップゲームを作り始めるための基礎が身につくでしょう。

source: Let's start!
ja: いよいよ始まりますよ！

source: Let's Table That: Creating Games with TabletopKit for visionOS
ja: visionOS向けTabletopKitでゲームを作ろう
